# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [16]:
import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [17]:
import pandas as pd

a = pd.Series([100, 200, 300, 400])

Print a, and data type

In [18]:
a

0    100
1    200
2    300
3    400
dtype: int64

Using indexing access the element 300 from the series a.

In [19]:

a[2]

300

What are the values of index for series a?

In [20]:
a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [21]:
a.reindex(['c', 'a', 'b', 'd'])

c   NaN
a   NaN
b   NaN
d   NaN
dtype: float64

Access the value in the series with index 'd'

In [22]:
import pandas as pd

a = pd.Series([100, 200, 300, 400], index=['c', 'a', 'b', 'd'])

# Access the value with index 'd'
value_d = a['d']

# Print the result
print(value_d)

400

Sort the values wrt to the index and print it

In [23]:
a.sort_index()

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [24]:
b = pd.Series([800, 450, 100], index=['e', 'f', 'g'])

# Print the Series 'b'
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [32]:
import pandas as pd

# Original Series 'a'
a = pd.Series([100, 200, 300, 400], index=['c', 'a', 'b', 'd'])

# New Series 'b'
b = pd.Series([800, 450, 100], index=['e', 'f', 'g'])

# Concatenate 'b' to 'a'
a_appended = pd.concat([a, b])

# Print the result
print(a_appended)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

In [33]:
#print a again after appending b into it
print(a_appended)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [34]:
a.sort_values(ascending=False)

d    400
b    300
a    200
c    100
dtype: int64

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [35]:
df = pd.DataFrame(a, columns=['values'])

In [36]:
print(df)

   values
c     100
a     200
b     300
d     400

What is the shape of the datafarme <br>
(also, what does it imply?)

In [37]:



print(df.shape)

(4, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [38]:
print(df.index)

Index(['c', 'a', 'b', 'd'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [39]:

print("Head of the DataFrame:")
print(df.head())

print("\nTail of the DataFrame:")
print(df.tail())

Head of the DataFrame:
   values
c     100
a     200
b     300
d     400

Tail of the DataFrame:
   values
c     100
a     200
b     300
d     400

Rename the column of the dataframe as 'points'

In [40]:
df = df.rename(columns={'values': 'points'})
print(df)

   points
c     100
a     200
b     300
d     400

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [41]:
fruit_names = ['orange', 'mango', 'apple']

fruits = pd.Series(np.random.choice(fruit_names, size=7))

In [42]:
print(fruits)

0     apple
1     mango
2     apple
3     apple
4    orange
5     mango
6     mango
dtype: object

Change the index of fruits to the index of dataframe df

In [43]:
fruits.reindex(df.index)

c    NaN
a    NaN
b    NaN
d    NaN
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [44]:
a = pd.Series([100, 200, 300, 400], index=['c', 'a', 'b', 'd'])

df = pd.DataFrame(a, columns=['values'])

fruit_names = ['orange', 'mango', 'apple']

fruits = pd.Series(np.random.choice(fruit_names, size=7), name='fruits')
fruits = fruits.reindex(df.index)

df['fruits'] = fruits
print(df.head())

   values fruits
c     100    NaN
a     200    NaN
b     300    NaN
d     400    NaN

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [45]:
data = {
    'city': ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali'],
    'Temperature': [15, 22, 20, 26, -2]
}

d1 = pd.DataFrame(data)

Print(d1)

In [46]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [47]:
print(d1.shape)

(5, 2)

Set city = d1['city']

In [48]:
city = d1['city']

print city <br>
What is the type of city.

In [49]:
print(city)

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [51]:
data2 = {
    'city': ['Bengalaru', 'Coimbatore', 'Srirangam', 'Pondicherry'],
    'Temperature': [24, 35, 36, 39]
}

d2 = pd.DataFrame(data2)
print(d2)

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [52]:
print(d2.shape)

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [54]:
d3 = pd.concat([d1, d2], ignore_index=True)
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
5    Bengalaru           24
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [55]:
selected_cities = d3[d3['Temperature'] <= 20]
print(selected_cities)

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [56]:
selected_cities_high_temp = d3[d3['Temperature'] >= 35]
print(selected_cities_high_temp)

          city  Temperature
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [58]:
union_territories = ['Chandigarh', 'Pondicherry', 'Delhi']

def is_union_territory(city):
    return city in union_territories

d3['is_union_territory'] = d3['city'].apply(is_union_territory)

In [59]:
# print d3

print(d3)

          city  Temperature  is_union_territory
0   Chandigarh           15                True
1        Delhi           22                True
2       Kanpur           20               False
3      Chennai           26               False
4       Manali           -2               False
5    Bengalaru           24               False
6   Coimbatore           35               False
7    Srirangam           36               False
8  Pondicherry           39                True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [61]:
def c_to_f(celsius_temp):
    return (celsius_temp * 9/5) + 32

d3['Temperature_Fahrenheit'] = d3['Temperature'].apply(c_to_f)

print(d3)

          city  Temperature  is_union_territory  Temperature_Fahrenheit
0   Chandigarh           15                True                    59.0
1        Delhi           22                True                    71.6
2       Kanpur           20               False                    68.0
3      Chennai           26               False                    78.8
4       Manali           -2               False                    28.4
5    Bengalaru           24               False                    75.2
6   Coimbatore           35               False                    95.0
7    Srirangam           36               False                    96.8
8  Pondicherry           39                True                   102.2

In [62]:
def c_to_f(celsius_temp):
    return (celsius_temp * 9/5) + 32

result = c_to_f(10)

print(result)

50.0

In [64]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['Temperature_Fahrenheit'] = d3['Temperature'].apply(c_to_f)
print(d3)

          city  Temperature  is_union_territory  Temperature_Fahrenheit
0   Chandigarh           15                True                    59.0
1        Delhi           22                True                    71.6
2       Kanpur           20               False                    68.0
3      Chennai           26               False                    78.8
4       Manali           -2               False                    28.4
5    Bengalaru           24               False                    75.2
6   Coimbatore           35               False                    95.0
7    Srirangam           36               False                    96.8
8  Pondicherry           39                True                   102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [65]:
union_territory_cities = d3[d3['is_union_territory']]
print(union_territory_cities)

          city  Temperature  is_union_territory  Temperature_Fahrenheit
0   Chandigarh           15                True                    59.0
1        Delhi           22                True                    71.6
8  Pondicherry           39                True                   102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [67]:
high_temp_cities = d3[d3['Temperature_Fahrenheit'] > 90]
print(high_temp_cities)

          city  Temperature  is_union_territory  Temperature_Fahrenheit
6   Coimbatore           35               False                    95.0
7    Srirangam           36               False                    96.8
8  Pondicherry           39                True                   102.2

Select only the first three rows of the dataframe d1.

In [68]:
 d3.head(3)

         city  Temperature  is_union_territory  Temperature_Fahrenheit
0  Chandigarh           15                True                    59.0
1       Delhi           22                True                    71.6
2      Kanpur           20               False                    68.0

Select all the rows and last two columns in the dataframe.

In [69]:
d3.iloc[:, -2:]

   is_union_territory  Temperature_Fahrenheit
0                True                    59.0
1                True                    71.6
2               False                    68.0
3               False                    78.8
4               False                    28.4
5               False                    75.2
6               False                    95.0
7               False                    96.8
8                True                   102.2

## Groupby

In [70]:
# Create a dataframe using dictionary of your choice

# data = 
data = {
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [28, 24, 22],
    'City': ['New York', 'San Francisco', 'Los Angeles']
}

df = pd.DataFrame(data)

print(df)

    Name  Age           City
0   John   28       New York
1  Alice   24  San Francisco
2    Bob   22    Los Angeles

In [75]:
# Use Groupby of single column with aggregate sum()

IndentationError: unexpected indent (3518925535.py, line 3)

In [22]:
# Use Groupby of single column with aggregate count()

In [23]:
# Use Groupby of single column with aggregate min() and max()

In [25]:
# Use Groupby of any 2 columns with aggregate mean()

In [26]:
# Use Groupby of any 2 columns with aggregate min() and max()

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [19]:
# a =

print a

What is the len of a?

What is the type of a?